doc/AddressBook3d.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-20 Wed 10:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A second sketch of an Alloy model in FOL</title>
<meta name="author" content="CMSMcQ" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">A second sketch of an Alloy model in FOL</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgeec39e6">1. The top-level module declaration and import</a>
<ul>
<li><a href="#org4e15e85">1.1. The model</a></li>
<li><a href="#org43e5cb4">1.2. The logical formulas</a></li>
</ul>
</li>
<li><a href="#orga466cf9">2. Signatures</a>
<ul>
<li><a href="#orgbd7e8d9">2.1. The mnodel</a></li>
<li><a href="#org7f8e724">2.2. Top-level signatures partitioning the universe</a></li>
<li><a href="#org368d4e8">2.3. Nested signatures</a></li>
<li><a href="#org16a60f7">2.4. Fields / relations</a>
<ul>
<li><a href="#org9c04ae5">2.4.1. <span class="todo TODO">TODO</span> Check the interpretation of <code>names -&gt; some Target</code> against Jackson.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4575f02">3. Actions <i>add</i> and <i>del</i></a></li>
<li><a href="#orgba7837c">4. Traces, and the ordering over all books</a></li>
<li><a href="#org3267e3f">5. Assertions</a>
<ul>
<li><a href="#org90a65ed">5.1. <i>del</i> undoes <i>add</i></a></li>
<li><a href="#orge5dd777">5.2. <i>add</i> is idempotent</a></li>
<li><a href="#org1affc7d">5.3. <i>add</i> leaves lookup unaffected for other names</a></li>
<li><a href="#orgdb9dbf4">5.4. Lookup always produces some result</a></li>
</ul>
</li>
<li><a href="#orgcf0acdb">6. Check instructions</a></li>
</ul>
</div>
</div>
<p>
This document continues the work begun in <a href="AddressBook1.html">First sketch of an Alloy
model in FOL</a>; again, the goal is to sketch a set of FOPC formulas
which capture the meaning of an Alloy model.
</p>

<p>
The model appears on p. <i>tbd</i> of Jackson 2012 as figure 2.18,
as the end point in a series of elaborations illustrating different
aspects of model development with Alloy.
</p>

<p>
To simplify the discussion, we will divide the model into parts, and
for each part specify the corresponding FOPC formulas.
</p>

<div id="outline-container-orgeec39e6" class="outline-2">
<h2 id="orgeec39e6"><span class="section-number-2">1.</span> The top-level module declaration and import</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org4e15e85" class="outline-3">
<h3 id="org4e15e85"><span class="section-number-3">1.1.</span> The model</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The model begins by identifying itself and importing a utility module
for ordering, passing the name <i>Book</i> as the value of a parameter
declared by that utility module.  This import allows the model to
assume an ordering imposed on atoms of signature <i>Book</i>.
</p>

<div class="org-src-container">
<pre class="src src-alloy">module tour/addressBook3d ----- this is the final model in fig 2.18

open util/ordering [Book] as BookOrder
</pre>
</div>
</div>
</div>

<div id="outline-container-org43e5cb4" class="outline-3">
<h3 id="org43e5cb4"><span class="section-number-3">1.2.</span> The logical formulas</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The module declaration entails no formulas.
</p>

<p>
The import of the <i>ordering</i> utility will be discussed later.
</p>
</div>
</div>
</div>

<div id="outline-container-orga466cf9" class="outline-2">
<h2 id="orga466cf9"><span class="section-number-2">2.</span> Signatures</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgbd7e8d9" class="outline-3">
<h3 id="orgbd7e8d9"><span class="section-number-3">2.1.</span> The mnodel</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The model then defines signatures for different kinds of individual:
targets, addresses, names, aliases, groups, and books.
</p>
<div class="org-src-container">
<pre class="src src-alloy">
abstract sig Target { }
sig Addr extends Target { }
abstract sig Name extends Target { }

sig Alias, Group extends Name { }

sig Book {
        names: set Name,
        addr: names-&gt;some Target
} {
        no n: Name | n in n.^addr
        all a: Alias | lone a.addr
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f8e724" class="outline-3">
<h3 id="org7f8e724"><span class="section-number-3">2.2.</span> Top-level signatures partitioning the universe</h3>
<div class="outline-text-3" id="text-2-2">
<p>
In this model there are only two top-level signatures (plus whatever
Alloy automatically supplies); everything in the universe of discourse
is a <i>Target</i> or a <i>Book</i> (or auto-declared).
</p>
<div class="org-src-container">
<pre class="src src-fopc">(all x)(Target(x) or Book(x) or AUTO(x))
</pre>
</div>

<p>
The top-level signatures are pairwise disjoint.
</p>

<div class="org-src-container">
<pre class="src src-fopc">not(exists x)(Target(x) and Book(x))
not(exists x)(Target(x) and AUTO(x))
not(exists x)(Book(x) and AUTO(x))
</pre>
</div>
</div>
</div>

<div id="outline-container-org368d4e8" class="outline-3">
<h3 id="org368d4e8"><span class="section-number-3">2.3.</span> Nested signatures</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Note that <i>Target</i> is defined abstract and extended by <i>Addr</i> and
<i>Name</i>.  This means that every target is either an address or a name,
and none is both.  It also means that every address and every name
is a target.
</p>

<div class="org-src-container">
<pre class="src src-fopc">(all x : Target)(Addr(x) or Name(x))
not(exists x)(Addr(x) and Name(x))
(all x)(Name(x) implies Target(x))
(all x)(Addr(x) implies Target(x))
</pre>
</div>

<p>
The signature <i>Name</i> is concrete, and is extended by two
sub-signatures for aliases and groups.  This means that names may be
aliases or groups, no name is both an alias and a group, and there may
be names which are neither aliases nor groups.
</p>

<div class="org-src-container">
<pre class="src src-fopc">not(exists x)(Alias(x) and Group(x))
(all x)(Alias(x) implies Name(x))
(all x)(Group(x) implies Name(x))
</pre>
</div>

<p>
Note that since no cardinalities are given for any signatures,
there is no requirement that any individuals in these signatures
exist.
</p>
</div>
</div>

<div id="outline-container-org16a60f7" class="outline-3">
<h3 id="org16a60f7"><span class="section-number-3">2.4.</span> Fields / relations</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Books have a <i>names</i> field, which is just a set of names, and an
<i>addr</i> field, which maps names to targets.
</p>

<div class="org-src-container">
<pre class="src src-fopc">(all b, n)(names(b, n) implies (Book(b) and Name(n)))
(all b, n, t)(addr(b, n, t) implies (Book(b) and Name(n) and names(b, n) and Target(t)))
(all b, n)(names(b, n) implies (some t)(Target(t) and addr(b, n, t)))
</pre>
</div>
</div>

<div id="outline-container-org9c04ae5" class="outline-4">
<h4 id="org9c04ae5"><span class="section-number-4">2.4.1.</span> <span class="todo TODO">TODO</span> Check the interpretation of <code>names -&gt; some Target</code> against Jackson.</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
The <i>Book</i> signature also has a constraint saying that the <i>addr</i>
relation is acyclic: no name <i>n</i> appears in the set of names which can
be found by applying the <i>addr</i> lookup mapping to <i>n</i> any (positive)
number of times.  Also, any alias maps to at most one target.
</p>

<p>
<i>Can we capture transitive closure?</i>
</p>

<div class="org-src-container">
<pre class="src src-fopc">(all b, a)(Book(b) and Alias(a)
    implies (all x, y)(Alias(x) and Alias(y) 
    and addr(b, a, x) and addr(b, a, y)
    implies x ≠ y
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-org4575f02" class="outline-2">
<h2 id="org4575f02"><span class="section-number-2">3.</span> Actions <i>add</i> and <i>del</i></h2>
<div class="outline-text-2" id="text-3">
<p>
The model continues by defining two predicates describing changes to
address books, a function for looking names up in the <i>addr</i> field of
a book, aned an initialization predicate which specifies an
empty <i>Book</i>.
</p>

<div class="org-src-container">
<pre class="src src-alloy">pred add [b, b": Book, n: Name, t: Target] {
        t in Addr or some lookup [b, Name&amp;t]
        b".addr = b.addr + n-&gt;t
}

pred del [b, b": Book, n: Name, t: Target] {
        no b.addr.n or some n.(b.addr) - t
        b".addr = b.addr - n-&gt;t
}

fun lookup [b: Book, n: Name] : set Addr { n.^(b.addr) &amp; Addr }

pred init [b: Book]  { no b.addr }
</pre>
</div>
</div>
</div>

<div id="outline-container-orgba7837c" class="outline-2">
<h2 id="orgba7837c"><span class="section-number-2">4.</span> Traces, and the ordering over all books</h2>
<div class="outline-text-2" id="text-4">
<p>
A fact named <i>traces</i> is then declared specifying that in the universe
of discourse to be considered:
</p>

<ul class="org-ul">
<li>The first book in the sequence satisfies the <i>init</i> predicate
(i.e. has no mappings in its <i>addr</i> field).  It may be recalled the
import of the <i>ordering</i> utility imposed an ordering on all
individuals in the <i>Book</i> signature.</li>

<li>Every book in the sequence (except the last one) is related to its
successor either by the <i>add</i> action or the <i>del</i> action.</li>
</ul>

<p>
This fact allows the user to consider the effects of specified
operations on books.
</p>
<div class="org-src-container">
<pre class="src src-alloy">fact traces {
        init [first]
        all b: Book-last |
          let b" = b.next |
            some n: Name, t: Target |
              add [b, b", n, t] or del [b, b", n, t]
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3267e3f" class="outline-2">
<h2 id="org3267e3f"><span class="section-number-2">5.</span> Assertions</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org90a65ed" class="outline-3">
<h3 id="org90a65ed"><span class="section-number-3">5.1.</span> <i>del</i> undoes <i>add</i></h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-alloy">------------------------------------------------------

assert delUndoesAdd {
        all b, b", b"": Book, n: Name, t: Target |
                no n.(b.addr) and add [b, b", n, t] and del [b", b"", n, t]
                implies
                b.addr = b"".addr
}

// This should not find any counterexample.
check delUndoesAdd for 3
</pre>
</div>
</div>
</div>

<div id="outline-container-orge5dd777" class="outline-3">
<h3 id="orge5dd777"><span class="section-number-3">5.2.</span> <i>add</i> is idempotent</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-alloy">------------------------------------------------------

assert addIdempotent {
        all b, b", b"": Book, n: Name, t: Target |
                add [b, b", n, t] and add [b", b"", n, t]
                implies
                b".addr = b"".addr
}

// This should not find any counterexample.
check addIdempotent for 3

</pre>
</div>
</div>
</div>

<div id="outline-container-org1affc7d" class="outline-3">
<h3 id="org1affc7d"><span class="section-number-3">5.3.</span> <i>add</i> leaves lookup unaffected for other names</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-alloy">------------------------------------------------------

assert addLocal {
        all b, b": Book, n, n": Name, t: Target |
                add [b, b", n, t] and n != n"
                implies
                lookup [b, n"] = lookup [b", n"]
}

// This should not find any counterexample.
check addLocal for 3 but 2 Book

</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb9dbf4" class="outline-3">
<h3 id="orgdb9dbf4"><span class="section-number-3">5.4.</span> Lookup always produces some result</h3>
<div class="outline-text-3" id="text-5-4">
<p>
<i>I'm a little puzzled here.</i>
</p>
<div class="org-src-container">
<pre class="src src-alloy">------------------------------------------------------

assert lookupYields {
        all b: Book, n: b.names | some lookup [b,n]
}

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcf0acdb" class="outline-2">
<h2 id="orgcf0acdb"><span class="section-number-2">6.</span> Check instructions</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-alloy">// This should not find any counterexample.
check lookupYields for 3 but 4 Book

// This should not find any counterexample.
check lookupYields for 6
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 20 March 2024</p>
<p class="author">Author: CMSMcQ</p>
<p class="date">Created: 2024-03-20 Wed 10:32</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
